flowforge/parsers/OpenFoam_Parser/templates/hitec_argon/temp_LES/0/alpha.hitec.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      alpha.hitec;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            codedFixedValue;
        value           uniform 1;
        name            circularAlphaInletHitec;
        code            #{
            const vectorField& Cf = this->patch().Cf(); // Face centers
            scalarField alpha(this->size(), 1.0);        // Initialize all to 0
            const scalar R2 = sqr({radius});                // Radius^2 = 1e-6
            // New center location (negative means left bound)
            const scalar x0 = -{centroid};
            const scalar z0 = 0.0000;


            forAll(Cf, faceI)
            {
                const vector& c = Cf[faceI];
                scalar r2 = sqr(c.x() - x0) + sqr(c.z() - z0);     // Distance from center (x,z)

                if (r2 {inequal} R2)
                    alpha[faceI] = 0;                  // Inside radius -> alpha = 1
            }

            operator==(alpha); // Assign back to patch field
        #};
        codeInclude     #{
            #include "vectorField.H"
        #};
        codeOptions     #{
            -I$(FOAM_SRC)/OpenFOAM/lnInclude
        #};
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.hitec;
        inletValue      uniform 1;
        value           uniform 1;
    }
    walls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
