flowforge/parsers/OpenFoam_Parser/templates/hitec_argon/temp_LES/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          512;
        startFace       375488;
    }
    outlet
    {
        type            patch;
        nFaces          512;
        startFace       376000;
    }
    walls
    {
        type            wall;
        nFaces          8000;
        startFace       376512;
    }
)

// ************************************************************************* //
